def numerator():
    numerator_data = {
        1: {
            810: ["Лек", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а358"}],
            955: ["Лаб", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а353", "доц. Малютин А.Е.": "а364"}],
            1140: ["Упр", "ИН.ЯЗЫК", {"ст.пр. Куприянова Т.С.": "а307", "ст.пр. Можаева О.В.": "а322"}],
            1335: None
        },
        2: {
            810: [None, "ФИЗ-РА", None],
            955: ["Лек", "АЛГОРИТМИЧЕСКИЕ ЯЗЫКИ И ПРОГРАММИРОВАНИЕ", {"доц. Дмитриева Т.А.": "а337"}],
            1140: ["Упр" "МАТЕМАТИЧЕСКАЯ ЛОГИКА И ТЕОРИЯ АЛГОРИТМОВ", {"доц. Бакулева М.А.": "а157а"}],
            1335: None
        },
        3: {
            810: ["Лек", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Нелюхин С.А.": "а337"}],
            955: ["Упр", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Бодрова И.В.": "а441"}],
            1140: None,
            1335: None
        },
        4: {
            810: ["Лек.", "ИНФОРМАТИКА", {"ст.пр. Устюков Д.И.": "а337"}],
            955: [None, "ФИЗ-РА", None],
            1140: ["Лек", "ФИЛОСОФИЯ", {"доц. Крючков Н.Н.": "а337"}],
            1335: None
        },
        5: {
            810: ["Упр", "ФИЛОСОФИЯ", {"доц. Крючков Н.Н.": "а442"}],
            955: ["Упр", "ИНФОРМАТИКА", {"асс. Вьюгина А.А.": "а209"}],
            1140: ["Лаб", "АЛГОРИТМИЧЕСКИЕ ЯЗЫКИ И ПРОГРАММИРОВАНИЕ",
                   {"доц. Дмитриева Т.А.": "а206", "ст.пр. Москвитина О.А.": "а205"}],
            1335: None
        },
        # 6: {
        #     810: ["", "", {"": ""}],
        #     955: ["", "", {"": ""}],
        #     1140: ["", "", {"": ""}],
        #     1335: ["", "", {"": ""}]
        # },
        # 7: {
        #     810: ["", "", {"": ""}],
        #     955: ["", "", {"": ""}],
        #     1140: ["", "", {"": ""}],
        #     1335: ["", "", {"": ""}]
        # }
    }
    return numerator_data


def denominator():
    denominator_data = {
        1: {
            810: ["Лек", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а358"}],
            955: ["Упр", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а345"}],
            1140: ["Упр", "ИН.ЯЗЫК", {"ст.пр. Куприянова Т.С.": "а307", "ст.пр. Можаева О.В.": "а322"}],
            1335: None
        },
        2: {
            810: [None, "ФИЗ-РА", None],
            955: ["Лек", "МАТЕМАТИЧЕСКАЯ ЛОГИКА И ТЕОРИЯ АЛГОРИТМОВ", {"доц. Бакулева М.А.": "а.50а"}],
            1140: ["Лаб" "ИНФОРМАТИКА", {"асс. Бастрыкин А.С": "а122", "асс. Вьюгина А.А.": "а122"}],
            1335: None
        },
        3: {
            810: ["Лек", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Нелюхин С.А.": "а337"}],
            955: ["Упр", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Бодрова И.В.": "а441"}],
            1140: None,
            1335: None
        },
        4: {
            810: ["Лек", "ВВЕДЕНИЕ В ПРОФЕССИОНАЛЬНУЮ ДЕЯТЕЛЬНОСТЬ", {"доц. Никифоров М.Б.": "а337"}],
            955: [None, "ФИЗ-РА", None],
            1140: ["Лек", "ПРАВОВОЕ РЕГУЛИРОВАНИЕ В СФЕРЕ ИНФОРМАЦИОННО-КОММУНИКАЦИОННЫХ ТЕХНОЛОГИЙ",
                   {"доц. Слепов А.П.": "а337"}],
            1335: ["Упр", "ПРАВОВОЕ РЕГУЛИРОВАНИЕ В СФЕРЕ ИНФОРМАЦИОННО-КОММУНИКАЦИОННЫХ ТЕХНОЛОГИЙ",
                   {"доц. Слепов А.П.": "а441"}]
        },
        5: {
            810: ["Лаб", "МАТЕМАТИЧЕСКАЯ ЛОГИКА И ТЕОРИЯ АЛГОРИТМОВ",
                  {"доц. Бакулева М.А.": "а155", "доц. Бакулев А.В.": "а155"}],
            955: ["Лек", "РАЗРАБОТКА ИНЖЕНЕРНОЙ ДОКУМЕНТАЦИИ", {"доц. Акинина Н.В.": "а21БИ"}],
            1140: ["Упр", "РАЗРАБОТКА ИНЖЕНЕРНОЙ ДОКУМЕНТАЦИИ", {"доц. Акинина Н.В.": "а21БИ"}],
            1335: None
        }
    }
    return denominator_data


def main():
    numerator()
    denominator()
    test = numerator()[2][955][0]
    print(test)


if __name__ == '__main__':
    main()
