def numerator():
    numerator_data = {
        1: {
            "08:10": ["Лек", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а358"}],
            "09:55": ["Лаб", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а353", "доц. Малютин А.Е.": "а364"}],
            "11:40": ["Упр", "ИН.ЯЗЫК", {"ст.пр. Куприянова Т.С.": "а307", "ст.пр. Можаева О.В.": "а322"}],
            "13:35": [None]
        },
        2: {
            "08:10": ["ФИЗ-РА"],
            "09:55": ["Лек", "АЛГОРИТМИЧЕСКИЕ ЯЗЫКИ И ПРОГРАММИРОВАНИЕ", {"доц. Дмитриева Т.А.": "а337"}],
            "11:40": ["Упр", "МАТЕМАТИЧЕСКАЯ ЛОГИКА И ТЕОРИЯ АЛГОРИТМОВ", {"доц. Бакулева М.А.": "а157а"}],
            "13:35": [None]
        },
        3: {
            "08:10": ["Лек", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Нелюхин С.А.": "а337"}],
            "09:55": ["Упр", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Бодрова И.В.": "а441"}],
            "11:40": [None],
            "13:35": [None]
        },
        4: {
            "08:10": ["Лек.", "ИНФОРМАТИКА", {"ст.пр. Устюков Д.И.": "а337"}],
            "09:55": ["ФИЗ-РА"],
            "11:40": ["Лек", "ФИЛОСОФИЯ", {"доц. Крючков Н.Н.": "а337"}],
            "13:35": [None]
        },
        5: {
            "08:10": ["Упр", "ФИЛОСОФИЯ", {"доц. Крючков Н.Н.": "а442"}],
            "09:55": ["Упр", "ИНФОРМАТИКА", {"асс. Вьюгина А.А.": "а209"}],
            "11:40": ["Лаб", "АЛГОРИТМИЧЕСКИЕ ЯЗЫКИ И ПРОГРАММИРОВАНИЕ",
                      {"доц. Дмитриева Т.А.": "а206", "ст.пр. Москвитина О.А.": "а205"}],
            "13:35": [None]
        },
        6: {
            "08:10": [None],  # ["", "", {"": ""}],
            "09:55": [None],  # ["", "", {"": ""}],
            "11:40": [None],  # ["", "", {"": ""}],
            "13:35": [None],  # ["", "", {"": ""}]
        },
        7: {
            "08:10": [None],  # ["", "", {"": ""}],
            "09:55": [None],  # ["", "", {"": ""}],
            "11:40": [None],  # ["", "", {"": ""}],
            "13:35": [None],  # ["", "", {"": ""}]
        }
    }
    return numerator_data


def denominator():
    denominator_data = {
        1: {
            "08:10": ["Лек", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а358"}],
            "09:55": ["Упр", "ФИЗИКА", {"ст.пр. Иняков В.В.": "а345"}],
            "11:40": ["Упр", "ИН.ЯЗЫК", {"ст.пр. Куприянова Т.С.": "а307", "ст.пр. Можаева О.В.": "а322"}],
            "13:35": [None]
        },
        2: {
            "08:10": ["ФИЗ-РА"],
            "09:55": ["Лек", "МАТЕМАТИЧЕСКАЯ ЛОГИКА И ТЕОРИЯ АЛГОРИТМОВ", {"доц. Бакулева М.А.": "а.50а"}],
            "11:40": ["Лаб", "ИНФОРМАТИКА", {"асс. Бастрыкин А.С": "а122", "асс. Вьюгина А.А.": "а122"}],
            "13:35": [None]
        },
        3: {
            "08:10": ["Лек", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Нелюхин С.А.": "а337"}],
            "09:55": ["Упр", "ВЫСШАЯ МАТЕМАТИКА", {"доц. Бодрова И.В.": "а441"}],
            "11:40": [None],
            "13:35": [None]
        },
        4: {
            "08:10": ["Лек", "ВВЕДЕНИЕ В ПРОФЕССИОНАЛЬНУЮ ДЕЯТЕЛЬНОСТЬ", {"доц. Никифоров М.Б.": "а337"}],
            "09:55": ["ФИЗ-РА"],
            "11:40": ["Лек", "ПРАВОВОЕ РЕГУЛИРОВАНИЕ В СФЕРЕ ИНФОРМАЦИОННО-КОММУНИКАЦИОННЫХ ТЕХНОЛОГИЙ",
                      {"доц. Слепов А.П.": "а337"}],
            "13:35": ["Упр", "ПРАВОВОЕ РЕГУЛИРОВАНИЕ В СФЕРЕ ИНФОРМАЦИОННО-КОММУНИКАЦИОННЫХ ТЕХНОЛОГИЙ",
                      {"доц. Слепов А.П.": "а441"}]
        },
        5: {
            "08:10": ["Лаб", "МАТЕМАТИЧЕСКАЯ ЛОГИКА И ТЕОРИЯ АЛГОРИТМОВ",
                      {"доц. Бакулева М.А.": "а155", "доц. Бакулев А.В.": "а155"}],
            "09:55": ["Лек", "РАЗРАБОТКА ИНЖЕНЕРНОЙ ДОКУМЕНТАЦИИ", {"доц. Акинина Н.В.": "а21БИ"}],
            "11:40": ["Упр", "РАЗРАБОТКА ИНЖЕНЕРНОЙ ДОКУМЕНТАЦИИ", {"доц. Акинина Н.В.": "а21БИ"}],
            "13:35": [None]
        },
        6: {
            "08:10": [None],  # ["", "", {"": ""}],
            "09:55": [None],  # ["", "", {"": ""}],
            "11:40": [None],  # ["", "", {"": ""}],
            "13:35": [None],  # ["", "", {"": ""}]
        },
        7: {
            "08:10": [None],  # ["", "", {"": ""}],
            "09:55": [None],  # ["", "", {"": ""}],
            "11:40": [None],  # ["", "", {"": ""}],
            "13:35": [None],  # ["", "", {"": ""}]
        }
    }
    return denominator_data


def main():
    print("---ЧИСЛИТЕЛЬ---")
    for key, value in numerator().items():
        print(key)
        for time, classes in value.items():
            print(time, couple)

    print("\n---ЗНАМЕНАТЕЛЬ---")
    for key, value in denominator().items():
        print(key)
        for time, couple in value.items():
            print(time, couple)


if __name__ == '__main__':
    main()
